In [2]:
import numpy as np
import pandas as pd
title=pd.read_csv("titles.csv")
title.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

How many movies are listed in the titles dataframe?

In [3]:
print("No of movies listed are",title.count())

No of movies listed are title    244914
year     244914
dtype: int64

What are the earliest two films listed in the titles dataframe?

In [4]:
sorte=title.sort_values('year')
title.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

How many movies have the title "Hamlet"?

In [5]:
len1=len(title[title["title"]=="Hamlet"])
print("No of movies having the title Hamlet",len1)

No of movies having the title Hamlet 20

How many movies are titled "North by Northwest"?

In [6]:
len1=len(title[title["title"]=="North by Northwest"])
len1

1

When was the first movie titled "Hamlet" made?

In [7]:
title[title["title"]=="Hamlet"].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

List all of the "Treasure Island" movies from earliest to most recent.

In [14]:
treasure=title[title["title"]=="Treasure Island"].sort_values('year')
print("List of Treasure Island movies from earliest to most recent")
treasure

List of Treasure Island movies from earliest to most recent

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

How many movies were made in the year 1950?

In [13]:
print("No of movies made in the year 1950:",len(title[title["year"]==1950]))

No of movies made in the year 1950: 1113

How many movies were made in the year 1960?

In [12]:
print("No of movies made in the year 1960:",len(title[title["year"]==1960]))

No of movies made in the year 1960: 1549

How many movies were made from 1950 through 1959?

In [11]:
print("No of movies made from the year 1950 to 1959 are:",len(title[(title["year"] >= 1950) & (title["year"] <=1959)]))

No of movies made from the year 1950 to 1959 are: 12934

In what years has a movie titled "Batman" been released?

In [10]:
print("The years movie titles Batman are:\n",title[title["title"]=="Batman"])

The years movie titles Batman are:
          title  year
39349   Batman  1943
240896  Batman  1989

How many roles were there in the movie "Inception"?

In [30]:
cast=pd.read_csv("cast.csv")
cast[cast['title'] == 'Inception']['type'].count()

40

How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [31]:
cast[cast['title'] == 'Inception']['n'].isnull().sum()

16

But how many roles in the movie "Inception" did receive an "n" value?

In [32]:
cast[cast['title'] == 'Inception']['n'].notnull().sum()

24

Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [48]:
cast1=cast[cast["n"].notnull()].sort_values('n')
l = cast1[cast1['title'] == 'North by Northwest'][['name','n']].values.tolist()
print("The cast of 'North by Northwest' in their correct 'n'-value order,  ignoring roles that did not earn a numeric 'n' value:")
df = pd.DataFrame(l, columns = ['Name', 'n']) 
df

The cast of 'North by Northwest' in their correct 'n'-value order,  ignoring roles that did not earn a numeric 'n' value:

                Name     n
0         Cary Grant   1.0
1        James Mason   3.0
2     Leo G. Carroll   5.0
3      Martin Landau   8.0
4  Robert Ellenstein  11.0
5    Philip Coolidge  13.0
6      Patrick McVey  14.0
7       Edward Binns  15.0
8          Ken Lynch  16.0

Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [53]:
cast2=cast[cast['n'].notnull()].sort_values('n')
print("Displaying the entire cast, in n-order, of the 1972 film Sleuth:")
cast2=cast2[(cast2["title"]=="Sleuth") & (cast2['year']==1972)][['name','n']]
cast2

Displaying the entire cast, in n-order, of the 1972 film Sleuth:

                       name    n
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
1448690        Teddy Martin  6.0

Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [54]:
cast2=cast[cast['n'].notnull()].sort_values('n')
print("Displaying the entire cast, in n-order, of the 2007 film Sleuth:")
cast2=cast2[(cast2["title"]=="Sleuth") & (cast2['year']==2007)][['name','n']]
cast2

Displaying the entire cast, in n-order, of the 2007 film Sleuth:

                  name    n
326774   Michael Caine  1.0
1293634       Jude Law  2.0

How many roles were credited in the silent 1921 version of Hamlet?

In [62]:
cast3 = cast.loc[(cast['title']=='Hamlet') & (cast['year']==1921)]
cast3['character'].count()

          title    year              name   type     character    n
7789     Hamlet  1921.0  Fritz Achterberg  actor   Fortinbras,  9.0
458904   Hamlet  1921.0      Paul Conradi  actor  K?nig Hamlet  2.0
555034   Hamlet  1921.0  Anton De Verdier  actor       Laertes  7.0
1135279  Hamlet  1921.0   Hans Junkermann  actor      Polonius  6.0

4

How many roles were credited in Branagh’s 1996 Hamlet?

In [91]:
cast4=cast[(cast['title']=='Hamlet') & (cast['year']==1996)]['character'].count()
cast4

32

How many "Hamlet" roles have been listed in all film credits through history?

In [88]:
cast5=cast[cast.title=='Hamlet']
cast5.character.count()

177

How many people have played an "Ophelia"?

In [66]:
len(cast[cast['character']=='Ophelia'])

6

How many people have played a role called "The Dude"?

In [68]:
len(cast[cast['character']=='The Dude'])

13

How many people have played a role called "The Stranger"?

In [69]:
len(cast[cast['character']=='The Stranger'])

128

How many roles has Sidney Poitier played throughout his career?

In [73]:
len(cast[cast['name']=='Sidney Poitier'])

0

How many roles has Judi Dench played?

In [75]:
cast[cast['name'] == "Judi Dench"]['character'].count()

0

List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [81]:
cast6 = cast[(cast['name'] == "Cary Grant") & (cast['n'] == 2) & (cast['year'] >= 1940) & (cast['year'] < 1950)]
li = cast6[['character','year']].values.tolist()
print("Following are the supporting roles played by Cary Grant in the 1940s:\n")
cg = pd.DataFrame(li, columns = ['Supporting Role', 'Year'])
cg

Following are the supporting roles played by Cary Grant in the 1940s:

  Supporting Role    Year
0      Nick Arden  1940.0
1     Roger Adams  1941.0

List the leading roles that Cary Grant played in the 1940s in order by year.

In [105]:
cast7 = cast[(cast['name'] == "Cary Grant") & (cast['n'] == 1) & (cast['year'] >= 1940) & (cast['year'] < 1950)].sort_values('year')
li = cast7[['character','year']].values.tolist()
print("Following are the Lead roles played by Cary Grant in the 1940s:\n")
cg = pd.DataFrame(li, columns = ['Lead Role', 'Year'])
cg

Following are the Lead roles played by Cary Grant in the 1940s:

                               Lead Role    Year
0                            Matt Howard  1940.0
1                           Walter Burns  1940.0
2                     C. K. Dexter Haven  1940.0
3                       Johnnie Aysgarth  1941.0
4                           Leopold Dilg  1942.0
5                  Patrick 'Pat' O'Toole  1942.0
6                          Capt. Cassidy  1943.0
7   Joe Adams -posing as Joe Bascopolous  1943.0
8                            Jerry Flynn  1944.0
9                      Mortimer Brewster  1944.0
10                            Ernie Mott  1944.0
11                           Cole Porter  1946.0
12                                Devlin  1946.0
13                           Dick Nugent  1947.0
14                                Dudley  1947.0
15                         Jim Blandings  1948.0
16                     Dr. Madison Brown  1948.0
17                 Captain Henri Rochard  1949.0

How many roles were available for actors in the 1950s?

In [95]:
cast8=cast[(cast['type']=='actor') & (cast['year']>=1950) & (cast['year']<1960)]['type'].count()
cast8

104069

How many roles were available for actresses in the 1950s?

In [97]:
cast9=cast[(cast['type']=='actress') & (cast['year']>=1950) & (cast['year']<1960)]['type'].count()
cast9

0

How many leading roles (n=1) were available from the beginning of film history through 1980?

In [99]:
cast[(cast['n']==1) & (cast['year']>=1894) & (cast['year']<=1980)]['type'].count()

29550

How many non-leading roles were available through from the beginning of film history through 1980?

In [100]:
cast[(cast['n']>1) & (cast['year']>=1894) & (cast['year']<=1980)]['type'].count()

307191

How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [104]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980)]['n'].isnull().sum()

228923